Amiya200/stm32_water_tank/Core/Src/model_handle.c
            // Arm priming exactly when ON begins (once per ON phase).
#if defined(TWIST_PRIME_SECONDS) && (TWIST_PRIME_SECONDS > 0)
            twist_priming        = true;
            twist_prime_deadline = tnow + (uint32_t)TWIST_PRIME_SECONDS * 1000UL;
#endif
        } else {
            // Entering OFF phase
            stop_motor_keep_modes();
            twist_dry_cnt        = 0;
            twist_phase_deadline = tnow + (uint32_t)twistSettings.offDurationSeconds * 1000UL;
        }
    } else {
        // 5) Maintain current phase outputs until the deadline arrives
        if (twist_on_phase) {
            if (!Motor_GetStatus()) start_motor();
        } else {
            if (Motor_GetStatus())  stop_motor_keep_modes();
        }
    }
}

/* =======================
   SEARCH MODE
   ======================= */
typedef enum {
    SEARCH_GAP_WAIT = 0,
    SEARCH_PROBE,
    SEARCH_RUN
} SearchState;

static SearchState search_state = SEARCH_GAP_WAIT;
static uint32_t    search_deadline_ms = 0;
static uint8_t     search_dry_cnt = 0;

void ModelHandle_StartSearch(uint16_t gap_s, uint16_t probe_s)
{
    clear_all_modes();

    if (gap_s   == 0) gap_s   = 5;
    if (probe_s == 0) probe_s = 3;

    searchSettings.testingGapSeconds = gap_s;
    searchSettings.dryRunTimeSeconds = probe_s;

    searchSettings.searchActive = true;
    searchActive = true;

    stop_motor_keep_modes();
    search_state       = SEARCH_GAP_WAIT;
    search_deadline_ms = now_ms() + (uint32_t)searchSettings.testingGapSeconds * 1000UL;
    search_dry_cnt     = 0;
}
void ModelHandle_StopSearch(void)
{
    searchSettings.searchActive = false;
    searchActive = false;
    search_state = SEARCH_GAP_WAIT;
    stop_motor_keep_modes();
}
static inline bool isDryDebounced_RUN(void)
{
    if (dry_raw_is_dry()) {
        if (search_dry_cnt < 255) search_dry_cnt++;
    } else {
        search_dry_cnt = 0;
    }
    return (search_dry_cnt >= 3);
}
static void search_tick(void)
{
    if (!searchSettings.searchActive) { searchActive = false; return; }
    searchActive = true;

    uint32_t nowt = now_ms();

    if (isTankFull()) {
        ModelHandle_StopAllModesAndMotor();
        return;
    }

    switch (search_state)
    {
        case SEARCH_GAP_WAIT:
            if (Motor_GetStatus()) stop_motor_keep_modes();
            if ((int32_t)(search_deadline_ms - nowt) <= 0) {
                start_motor(); // probe ON
                search_state       = SEARCH_PROBE;
                search_deadline_ms = nowt + (uint32_t)searchSettings.dryRunTimeSeconds * 1000UL;
                search_dry_cnt     = 0;
            }
            break;

        case SEARCH_PROBE:
            if (!dry_raw_is_dry()) {
                // Water detected → RUN
                search_state       = SEARCH_RUN;
                search_deadline_ms = 0;
                search_dry_cnt     = 0;
                break;
            }
            if ((int32_t)(search_deadline_ms - nowt) <= 0) {
                // Still dry after probe
                stop_motor_keep_modes();
                search_state       = SEARCH_GAP_WAIT;
                search_deadline_ms = nowt + (uint32_t)searchSettings.testingGapSeconds * 1000UL;
            }
            break;

        case SEARCH_RUN:
            if (isDryDebounced_RUN()) {
                ModelHandle_StopAllModesAndMotor(); // terminal dry -> clear modes
                break;
            }
            if (!Motor_GetStatus()) start_motor(); // keep asserted
            break;
    }
}

/* =======================
   TIMER (RTC based)
   ======================= */


void ModelHandle_SetTimerSlot(uint8_t i,
                              uint8_t onH, uint8_t onM,
                              uint8_t offH, uint8_t offM,
                              bool en)
{
    if (i < 5)
    {
        timerSlots[i].enabled = en;
        timerSlots[i].onHour = onH;
        timerSlots[i].onMinute = onM;
        timerSlots[i].offHour = offH;
        timerSlots[i].offMinute = offM;
    }
}

void ModelHandle_ProcessTimerSlots(void)
{
    RTC_GetTimeDate();  // update 'time' from RTC

    uint16_t nowM = time.hour * 60 + time.minutes;
    bool motorShouldRun = false;

    for (uint8_t i = 0; i < 5; i++)
    {
        if (!timerSlots[i].enabled)
            continue;

        uint16_t onM  = timerSlots[i].onHour * 60 + timerSlots[i].onMinute;
        uint16_t offM = timerSlots[i].offHour * 60 + timerSlots[i].offMinute;

        if (onM < offM)
        {
            if (nowM >= onM && nowM < offM)
                motorShouldRun = true;
        }
        else  // handle midnight wrap-around (e.g., 23:00 → 02:00)
        {
            if (nowM >= onM || nowM < offM)
                motorShouldRun = true;
        }
    }

    ModelHandle_SetMotor(motorShouldRun);
}

static uint32_t seconds_since_midnight(void)
{
    RTC_GetTimeDate();
    return ((uint32_t)time.hour * 3600UL) +
           ((uint32_t)time.minutes * 60UL) +
           (uint32_t)time.seconds;
}
/* =========================
   TIMER MODE
   ========================= */
void timer_tick(void)
{
    if (!timerActive) return;

    RTC_GetTimeDate();
    uint32_t nowSec = ModelHandle_TimeToSeconds(time.hour, time.minutes);

    bool shouldRun = false;
    for (int i = 0; i < 5; i++) {
        if (!timerSlots[i].enabled) continue;

        uint32_t onSec  = ModelHandle_TimeToSeconds(timerSlots[i].onHour,  timerSlots[i].onMinute);
        uint32_t offSec = ModelHandle_TimeToSeconds(timerSlots[i].offHour, timerSlots[i].offMinute);

        if (onSec < offSec) {
            if (nowSec >= onSec && nowSec < offSec) shouldRun = true;
        } else { // overnight slot (e.g. 23:00–05:00)
            if (nowSec >= onSec || nowSec < offSec) shouldRun = true;
        }
    }

    if (shouldRun && !Motor_GetStatus()) {
        start_motor();
    } else if (!shouldRun && Motor_GetStatus()) {
        stop_motor_keep_modes();
    }
}
void ModelHandle_StartTimer(void) {
    clear_all_modes();
    timerActive = true;
}

void ModelHandle_StopTimer(void) {
    timerActive = false;
    stop_motor_keep_modes();
}


/* =======================
   SEMI-AUTO
   ======================= */
void ModelHandle_StartSemiAuto(void)
{
    clear_all_modes();
    semiAutoActive = true;

    if (!isTankFull()) {
        start_motor();
        //printf("Semi-Auto Started\r\n");
    } else {
        ModelHandle_StopAllModesAndMotor();
        //printf("Semi-Auto Not Started: Already Full\r\n");
    }
}
void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive   = false;
    ModelHandle_StopAllModesAndMotor();
    //printf("Semi-Auto Stopped\r\n");
}
static void semi_auto_tick(void)
{
    if (!semiAutoActive) return;

